
## 4884回
  # ?      # 497     # 060      # 221      # 415      # 881        # 372      # 043      # 782    # 385 # 046 # 021
 0 -> xxx  0 -> x    0 -> xxx   0 ->       0 -> x      0 -> x      0 -> xx    0 ->       0 -> x
 1 -> xxx  1 -> xxx  1 -> x     1 -> xxxx  1 -> x      1 -> x      1 -> xx    1 -> xx    1 -> xxxx
 2 -> xx   2 -> xx   2 -> xxx   2 -> x     2 -> xxxxx  2 -> xxxxx  2 -> xxx   2 -> xxxx  2 -> x
 3 -> x    3 -> x    3 -> x     3 -> xxx   3 -> x      3 -> xxxxx  3 -> xx    3 -> xxx   3 -> x
 4 -> x    4 -> xx   4 -> xx    4 -> xxx   4 ->        4 -> xxx    4 ->       4 ->       4 -> x
 5 ->      5 -> xx   5 -> xxx   5 ->       5 -> xxx    5 ->        5 -> x     5 ->       5 -> 
 6 -> x    6 -> xx   6 -> x     6 -> xx    6 -> x      6 -> xx     6 -> xxx   6 -> xx    6 -> xx
 7 -> x    7 -> xxx  7 -> xx    7 ->       7 -> x      7 -> x      7 -> x     7 -> xxx   7 -> xxxx
 8 -> xx   8 -> x    8 ->       8 -> x     8 -> x      8 -> x      8 -> xxx   8 -> xxx   8 -> 
 9 -> xxxx 9 ->      9 -> xx    9 -> xxx   9 -> xxx    9 -> xx     9 -> x     9 -> x     9 -> xx
 n, n, n   2, 0, 3,- 3, 1, 3,-  1, 1, 4,-  0, 1, 3,-   1, 1, 1,    2, 1, 3,   0, 0, 3,   4, 0, 1

# 385      # 046         # 021
 0 ->      0 -> xxxx     0 -> x
 1 -> xx   1 -> x        1 -> x
 2 -> xxx  2 -> xxxxx    2 -> xxx
 3 -> xx   3 -> xx       3 -> xxxx
 4 -> x    4 ->          4 -> x
 5 -> x    5 -> xx       5 -> xx
 6 -> xxx  6 ->          6 -> x
 7 -> xx   7 -> x        7 -> 
 8 -> x    8 -> x        8 -> x
 9 -> x    9 -> x        9 -> xxxx
 2, 1, 1,  4, 0, 0,      1, 3, 1

 - 5個の数字あって、4個数字もあると、4個の数字は選択される
 - 0個の数字が一個のみ時は、0個の数字は選択されないが
 - 0個の数字が複数ある場合は、0個の数字も選択される
 - 4個の数字が複数存在していても、選択される保証はない
 - パターン個数を選択されるが、桁も一致するとは限らない

1 -> [3, 4, 6, 7]
1 -> [3, 4, 6, 7]
4 -> [9 ]

3 -> [0, 1]
2 -> [2, 8]
1 -> [3, 4, 6, 7]

0 -> 9
1 -> [3, 4, 6, 7]
3 -> [0, 1]

1 -> [3, 4, 6, 7]
3 -> [0, 1]
1 -> [3, 4, 6, 7]

 
"021" 
"046"
"385"
"782"
"043"
"372"
"881"
"415"
"221"
"060"
"497"



